(function() {
    const p = [`一个朋友从东部来了信，我遵他的命去拜访了好脾气、爱絮叨的西蒙·威勒，打听我朋友的朋友列昂尼达斯·W·斯迈雷的下落。这件受人之托的事究竟结果如何，我来做个交代。
    事后我心里嘀咕， 这位列昂尼达斯· W· 斯迈雷是瞎编出来的， 我朋友根本就不认识此人。 他准是琢磨着： 只要我向老威勒一打听， 就会让他联想起那个厚脸皮的吉姆· 斯迈雷来， 赶快打开话匣子把那些又臭又长、 和我毫不相干的陈年旧事抖搂出来， 把我顷死。 要是我朋友存心这么干， 那他真是做对了。
    　　 我见到西蒙· 威勒的时候， 他正在破破烂烂的矿山屯子安吉尔那座歪歪斜斜的酒馆里， 靠着吧台旁边的炉子舒舒服服地打盹。 我注意到他是个胖子， 秃脑门， 一脸安详， 透着和气、 朴实。 他站起身来问了声好。
    我告诉他， 朋友托我来打听一位儿时的密友， 这人叫列昂尼达斯· W· 斯迈雷—— 也就是列昂尼达斯· W· 斯迈雷神父， 听说这位年轻的福音传教士曾在安吉尔屯子里住过。 我又加了一句： 要是威勒先生能告诉我这位列昂尼达斯· W· 斯迈雷神父的消息， 我将感激不尽。
    　　 西蒙· 威勒把我逼到墙角， 拿自己的椅子封住我的去路， 然后讲了一通下面段落里那些枯燥无味的事情。 他脸上不露一丝笑意， 眉头一皱不皱， 从第一句起， 他用的就是四平八稳的腔调， 没有变过。
    他绝不是生性就爱唠叨； 因为他收不住的话头里透着认认真真、 诚心诚意的感人情绪， 这是明明白白地告诉我， 按他的想法， 别管这故事本身是不是荒唐可笑， 他可是把讲故事当成一件要紧事来办， 而且对故事里的两位主人公推崇备至， 认为他们智谋超群。 我听凭他按照自己的路子讲下去， 一直没有打断。
    　　 列昂尼达斯神父， 嗯， 列神父—— 嗯， 这里从前倒是有过一个叫吉姆· 斯迈雷的， 那是四九年冬天—— 也许是五0年春天—— 不知道怎么闹的， 我记不太清楚了， 总归不是四九年就是五0年， 因为他刚来到屯子的时候， 那大渡槽还没造好呢； 别的不说， 要比谁最古怪， 他算得上天下第一。`, `
    只要能找到一个人愿打赌，他就赔，碰上什么就赌什么。别人要是不愿赌黑，他就赌黑；别人不愿赌白，他就赌白。不管怎么样，别人想怎么赌，他都陪着——不管怎么样，只要能赌得起来，他就舒服了。
虽说这样，他照样有好运气，那可不是一般的好，十有八九总是他赢。他老惦记找机会打赌；无论大事小事，只要有人提出来，不管你的注往哪一边下，他都照赌不误，这些我刚才都告诉过你啦。
赛的要是马，收场的时候他不是赢得满满当当，就是输得一干二净；如果斗的是狗，他赌；斗的是猫，他赌；斗的是鸡，他还赌；嘿，就算有两只鸟落在篱笆上，他也要跟你赌哪一只先飞；屯子里聚会他必到，到了就拿沃尔克牧师打赌，他打赌说，沃尔克牧师布道在这一带是头一份；那还用说，他本来就是个好人么。
要是他看见一只屎克螂朝哪里开步走，他就跟你赌它几天才能到——不论到哪儿都行；只要你接茬，哪怕是去墨西哥，他也会跟着那只屎克螂，看看它到底去不去那儿，路上得花几天的时间。
这儿的小伙子好多都见过斯迈雷，都能给你讲讲这个人。嘿，讲起他的事来可是绝对重不了样——他不论什么都赌——那家伙特有意思。`,
        `有一回，沃尔克牧师的太太病得不轻，有好几天的工夫，眼看着她就没救了；可一天早晨牧师进来了，斯迈雷站起来问他太太怎么样，他说，她好多了——全凭主的大恩大德——看这势头，有主保佑，她能缓过来；还没等他讲完，斯迈雷来了一句：“这样吧，我押两块五，赌她缓不过来。”
　　这个斯迈雷有一匹母马——小伙子们都管它叫“一刻钟老太太”，这话损了点儿，它跑得当然比这快一点儿——他还经常靠这匹马赢钱呢。
因为它慢慢吞吞的，不是得气喘，生瘟热，就是有痨病，以及这一类乱七八糟的病。他们总是让它先跑两三百码，可等到了终点跟前，它就抖起精神，拼了老命，撒欢尥蹶子；四只蹄子到处乱甩，甩空了的也有，甩偏了踢到篱笆上的也有，弄得尘土飞扬，再加上咳嗽、打喷嚏、攥鼻涕，闹闹哄哄——赶到裁判席前头的时候，它总是比别的马早一个头，早得刚好让人能看明白。
　　他还有一只小斗狗，光看外表你准以为它一钱不值，就配在那儿拴着，一副贼溜溜的样子，老想偷点什么。
可是，一旦在它身上下了注，它转眼就变了一条狗；它的下巴颏往前伸着，就像火轮船的前甲板，下槽牙都露了出来，像煤火一样放光。
别的狗抓它、耍弄它、咬它，接二连三地给它来背口袋，可安得鲁·杰克逊——这是那条狗的名字——安得鲁·杰克逊老是装着没什么不自在的，好像它原本就没有别的盼头——押在另一边的赌注翻了倍再翻倍，一直到再没钱往上押了；这时候，它就一口咬住另一条狗的后腿，咬得死死的——不啃，你明白吗，光咬，叼着不动，直到那狗服软，哪怕等上一年也不要紧。
`, `斯迈雷老是靠这条狗赢钱，直到在一条没后腿的狗身上碰了钉子，因为那狗的后腿让锯片给锯掉了。那一次，两条狗斗了好一阵子，两边的钱都押完了，安得鲁·杰克逊上去照着咬惯了的地方下嘴的时候，当时就看出自个儿上当了，看出它怎么让别的狗给涮了。
怎么说呢，他当时好像是吃了一惊，跟着就有点儿没精打采，再也没有试着把那一场赢下来；他让人骗惨了。它朝斯迈雷瞧了一眼，好像是说它伤透了心，这都是斯迈雷的错，怎么弄了一条没有后腿的狗来让它咬呢，它斗狗本来靠的就是咬后腿嘛；后来，他一瘸一拐地溜达到旁边，倒在地上就死了。
那可是条好狗，那个安得鲁·杰克逊要是活着，准出了名了，胚子好，又聪明——我敢担保安得鲁·杰克逊有真本事；他什么场面没经过啊、一想起它最后斗的那一场，一想起它的下场来，我鼻子就发酸`
    ]

    const li = document.querySelectorAll('.boxli li');
    const essay = document.querySelector('.essaybox');
    li.forEach((element, index) => {
        element.onclick = function() {

            essay.innerHTML = p[index];
        }
    });
    essay.innerHTML = p[1];
})()